In [2]:
import numpy as np
import pandas as pd

In [3]:
df= pd.read_csv("HR RAW DATA.csv", index_col=0)
pd.set_option('display.max_columns', None)

In [4]:
df.head(2)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1

In [5]:
df.sample(5)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
907,30,No,travel_rarely,"413,0$",Sales,7,1,Marketing,1,"585,0",4,0,57,3,1,sALes rEprESentAtIvE,2,Single,NaN,18398,0,Y,NaN,14,"3,0",1,"80,0",0,NaN,3,"3,0",3,NaN,1,2,NaN,1993,1000000000$,sALes rEprESentAtIvE - Sales,NaN,True
709,39,No,travel_rarely,"141,0$",NaN,-24,3,NaN,1,"760,0",3,1,44,4,2,huMaN RESOurcES,2,NaN,NaN,18767,9,NaN,NaN,15,"3,0",3,"80,0",1,NaN,3,"1,0",8,NaN,3,6,NaN,1984,1000000000$,NaN,NaN,False
267,36,No,travel_rarely,"1299,0$",Research & Development,27,3,Medical,1,NaN,3,0,94,3,2,HeaLThCArE REpRESENTAtIVe,3,NaN,NaN,16577,6,Y,NaN,13,"3,0",2,NaN,2,"17,0",3,"2,0",7,NaN,7,7,NaN,1987,1000000000$,HeaLThCArE REpRESENTAtIVe - Research & Deve...,NaN,Yes
407,44,Yes,travel_rarely,"621,0$",NaN,15,3,Medical,1,"1295,0",1,1,73,3,3,hEALtHcARE rePrESeNtATIve,4,Married,NaN,14075,1,Y,NaN,11,"3,0",4,"80,0",1,NaN,2,"3,0",10,NaN,0,5,NaN,1979,1000000000$,NaN,NaN,Yes
209,32,No,NaN,"379,0$",NaN,5,2,Life Sciences,1,"889,0",2,0,48,3,2,saleS exECUtIve,2,NaN,NaN,8891,1,NaN,No,14,"3,0",4,"80,0",1,"10,0",3,"3,0",10,NaN,5,3,NaN,1991,1000000000$,NaN,NaN,1

In [6]:
df.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'employeecount',
       'employeenumber', 'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NUMCOMPANIESWORKED',
       'Over18', 'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TOTALWORKINGYEARS', 'TrainingTimesLastYear', 'WORKLIFEBALANCE',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YEARSWITHCURRMANAGER', 'SameAsMonthlyIncome', 'DateBirth', 'Salary',
       'RoleDepartament', 'NUMBERCHILDREN', 'RemoteWork'],
      dtype='object')

## ANÁLISIS MONTHLYINCOME Y SAMEASMONTHLYINCOME

In [46]:
df.loc[:,["MonthlyIncome", "SameAsMonthlyIncome"]]

     MonthlyIncome SameAsMonthlyIncome
0          19537,0             19537,0
1          19999,0             19999,0
2          19232,0             19232,0
3          17169,0             17169,0
4              NaN                 NaN
...            ...                 ...
1609       10325,0             10325,0
1610        4447,0              4447,0
1611           NaN                 NaN
1612           NaN                 NaN
1613       10845,0             10845,0

[1614 rows x 2 columns]

In [50]:
df.MonthlyIncome.value_counts()

MonthlyIncome
6347,0     4
5304,0     4
2657,0     3
2258,0     3
5405,0     2
          ..
3102,0     1
4556,0     1
4230,0     1
4859,0     1
19431,0    1
Name: count, Length: 668, dtype: int64

In [53]:
df.MonthlyIncome.duplicated().sum()

945

In [54]:
df.SameAsMonthlyIncome.duplicated().sum()

945

In [65]:
df.MonthlyIncome.describe()

count        771
unique       668
top       6347,0
freq           4
Name: MonthlyIncome, dtype: object

In [66]:
df.SameAsMonthlyIncome.describe()

count        771
unique       668
top       6347,0
freq           4
Name: SameAsMonthlyIncome, dtype: object

In [31]:
minors= df.loc[df["DateBirth"] >= 2006]
minors[["Over18", "DateBirth"]]

Empty DataFrame
Columns: [Over18, DateBirth]
Index: []

In [32]:
df.loc[:,["Over18", "DateBirth"]].head(2)

  Over18  DateBirth
0      Y       1972
1    NaN       1971

In [34]:
df["DateBirth"].isnull().sum()

0

In [36]:
df["DateBirth"].unique()

array([1972, 1971, 1981, 1976, 1977, 1975, 1964, 1982, 1967, 1985, 1968,
       1983, 1965, 1988, 1978, 1990, 1987, 1989, 1970, 1980, 1963, 1991,
       1986, 1974, 1984, 1973, 1979, 1993, 1994, 1992, 1969, 1966, 1996,
       1995, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005],
      dtype=int64)

In [72]:
df.NUMBERCHILDREN.unique()

array([nan])

In [39]:
df.dtypes

Age                          object
Attrition                    object
BusinessTravel               object
DailyRate                    object
Department                   object
DistanceFromHome              int64
Education                     int64
EducationField               object
employeecount                 int64
employeenumber               object
EnvironmentSatisfaction       int64
Gender                        int64
HourlyRate                   object
JobInvolvement                int64
JobLevel                      int64
JobRole                      object
JobSatisfaction               int64
MaritalStatus                object
MonthlyIncome                object
MonthlyRate                   int64
NUMCOMPANIESWORKED            int64
Over18                       object
OverTime                     object
PercentSalaryHike             int64
PerformanceRating            object
RelationshipSatisfaction      int64
StandardHours                object
StockOptionLevel              int64
TOTALWORKINGYEARS            object
TrainingTimesLastYear         int64
WORKLIFEBALANCE              object
YearsAtCompany                int64
YearsInCurrentRole           object
YearsSinceLastPromotion       int64
YEARSWITHCURRMANAGER          int64
SameAsMonthlyIncome          object
DateBirth                     int64
Salary                       object
RoleDepartament              object
NUMBERCHILDREN              float64
RemoteWork                   object
dtype: object

## ERRORES

Nombres de columnas inconsistentes.
 RoleDepartment - problemas mayus/minus
 BusinessTravel, dif guiones en registros (travel_rarely / non-travel) 


employeecount de qué sirve?
employeenumber porqué es float?
Diferencia entre employeenumber y employeeID (en employeenumber muchos son Nan) borrar employeenumber?
Salary está mal o por qué son todos 1000000000$	?
daily rate 914 = nan$	?
JobRole muchas inconsistencias de mayus y minus
MonthlyIncome	MonthlyRate -en qué se diferencian? distintos values
HourlyRate 1108 - Notavailable cambiar por Nan

¿Columnas duplicadas?
salary/ monthly income/ dailyrate/ sameasmonthlyincome
roledepartment /jobrole/department
enviromentsatisfaction/jobsatisfaction

# DistanceFromHome, valores negativos
# Muchas columnas que son de tipo objetos
# RemoteWork unificar Yes/True y 1/0 pasar a booleanos
# columna unnamed a employeeID
# over18 son todas Nan y Yes?

Attrition a booleanos T/F
daily rate pasar a float